Enums/НазначенияШаблоновЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>НазначенияШаблоновЭтикетокИЦенников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенникДляТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляСкладскихЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаСерииНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаУпаковочныхЛистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляШтрихкодовУпаковок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаОбъектаЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаКодМаркировкиИСМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PDF417</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataMatrix</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ITF14</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EAN13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code39</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Code128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SSCC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_DataBarExpandedStacked</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GS1_DataMatrix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ШаблоныЭтикетокИЦенниковЛокализация/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в обработке ЖурналДокументовЗакупки
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиАкцизныеМарки(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт

	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиШтрихкодыУпаковок(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиИСМП(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриОпределенииИсточниковКОформлению(МассивМенеджеровРасчетаСмТакжеВРаботе) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ПриЗаполненииСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, Назначение) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриЗаполненииДоступныхПолейКомпоновкиДанных(ИменаПолей, Назначение) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриИзмененииНазначенияПомощникНового(Форма, СтрокаПоискаТипа, ПризнакМакетаДляТоваров, МассивТипов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервереФормыВыбораШаблона(Форма, Параметры, ПризнакПредопределенногоМакета) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура УстановитьШаблонПоУмолчанию(Форма, Объект, ИмяШаблона) Экспорт
	
	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок Тогда
			
		Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.PDF417;
		Форма.ОтображатьТекст = Ложь;
			
	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляШтрихкодовУпаковок Тогда
		
		Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataBarExpandedStacked;
		Форма.ОтображатьТекст = Ложь;
		
	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаКодМаркировкиИСМП Тогда
		
		Форма.ТипШтрихкода       = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		Форма.ОтображатьТекст    = Ложь;
		Форма.Масштабировать     = Ложь;
		Форма.СохранятьПропорции = Истина;
		Если СтрНайти(ИмяШаблона, "Упаковка") > 0 Тогда
			Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128;
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПодготовитьСтруктуруМакетаШаблона(Назначение, Масштабировать, ТипКода, ТипШтрихкодаШаблона) Экспорт
	Если Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок Тогда
		ТипКода = 6;  // PDF417
		ТипШтрихкодаШаблона = Перечисления.ТипыШтрихкодов.PDF417;
	ИначеЕсли Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаКодМаркировкиИСМП Тогда
		ТипКода = 24;  // DataMatrix
		ТипШтрихкодаШаблона = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		Масштабировать = Ложь;
	КонецЕсли;
КонецПроцедуры

//++ Локализация
//-- Локализация

Процедура ПриИзмененииНазначенияШаблонаВСправочникеШаблонов(Форма, ОчищатьНазначение, МассивТипов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
